chore: security recommendations
